Revit 2026 API

# RebarFreeFormAccessorSetLayoutAsNumberWithSpacing Method

---

Sets the Layout Rule property of rebar set to Number With Spacing.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetLayoutAsNumberWithSpacing(
	int numberOfBars,
	double spacing
)
```
```vb
Public Sub SetLayoutAsNumberWithSpacing (
	numberOfBars As Integer,
	spacing As Double
)
```
```cpp
public:
void SetLayoutAsNumberWithSpacing(
	int numberOfBars,
	double spacing
)
```
```fsharp
member SetLayoutAsNumberWithSpacing :
        numberOfBars : int *
        spacing : float -> unit
```

#### Parameters

numberOfBars Int32
     The number of bars in set.
spacing Double
     The spacing of bars in set.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | This RebarFreeFormAccessor doesn't contain a valid rebar reference. -or- This RebarFreeFormAccessor Rebar doesn't contain a valid server GUID. |

#### Reference

RebarFreeFormAccessor Class

Autodesk.Revit.DB.Structure Namespace